of70/tutorials/rheoFoam/OtherTests/tube_GNF/HerschelBulkley/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type            HerschelBulkley;
            
                rho             rho   [1 -3 0 0 0 0 0] 1050;
   		tau0            tau0  [ 1 -1 -2 0 0 0 0 ] .0175; 
   		k               k     [ 1 -1 -1 0 0 0 0 ] 8.9721e-3; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.8601; 
   		  		
   		PapanastasiouRegularization true;   
   		eta0            eta0  [ 1 -1 -1 0 0 0 0 ] 100;
   		m               m     [ 0 0 1 0 0 0 0 ] 1000;            
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
